[
    {
        "level": 0,
        "name": "None or N/A",
        "description": "No skill or ability demonstrated, or the skill is not required or applicable to the role.",
        "short_description": "No skill or ability",
        "focus": ""
    },
    {
        "level": 1,
        "name": "Awareness",
        "description": "Technical: has basic knowledge of the area and understands core techniques and concepts; can follow instructions and perform simple tasks with support, but the application of the skill is limited.\nNon-technical: recognises the importance of the skill, shows initial effort, and applies it inconsistently or only in simpler contexts.",
        "short_description": "Fundamental awareness (basic knowledge) or fundamental ability",
        "focus": "learning and remembering"
    },
    {
        "level": 2,
        "name": "Working",
        "description": "Technical: has the level of experience gained in a classroom or as a trainee on-the-job; applies the skill with some independence in familiar situations, still needs guidance when applying the skill but can draw on a range of reference materials; understands and can discuss terminology, concepts, principles, and issues related to this skill.\nNon-technical: understands the principles and issues; begins to reflect on practice and adapt behaviour.",
        "short_description": "Novice (limited experience) or emerging ability",
        "focus": "developing understanding and gaining independence through practice"
    },
    {
        "level": 3,
        "name": "Practitioner",
        "description": "Technical: applies skills confidently across a range of tasks; adapts existing solutions to challenges and supports peers; may occasionally require expert guidance; understands and can discuss the application and implications of changes to processes and policies in the skill area; contributes to reference and resource materials.\nNon-technical: consistently applies the skill with confidence; demonstrates maturity, self-reflection, and constructive collaboration and interaction with others; communicates effectively with varied audiences to enhance understanding and foster shared practice.",
        "short_description": "Practical application by a competent (intermediate to advanced) practitioner",
        "focus": "applying established practices, adapting to challenges, and deepening expertise and skill"
    },
    {
        "level": 4,
        "name": "Expert",
        "description": "Technical: highly skilled and independent; handles complex and unfamiliar challenges; recognised as an authority in the skill area, often mentoring others. creates new applications, contributes to or leads the development of reference and resource materials, and integrates the skill into wider systems, projects, or organisations.\nNon-technical: demonstrates exemplary use of the skill, adapting flexibly to complex or sensitive situations; mentors others, shapes cultural or systemic improvements, and applies the skill to influence organisational or sector-wide practices.",
        "short_description": "Leading and/or being a recognised authority",
        "focus": "designing new solutions, setting strategy, and shaping organisational or systemic direction through analysis, evaluation, and creation"
    }
]
